app/controllers/expences_controller.rb

  def index
    @expences = Expence.all
---
SELECT * FROM "expences" LIMIT 1

  def show
    @expence = Expence.find(params[:id])
---
SELECT * FROM `expences` WHERE (`expences`.`id` = 1)

  def edit
    @expence = Expence.find(params[:id])
---
SELECT * FROM `expences` WHERE (`expences`.`id` = 1)

  def create
    @expence = Expence.new(params[:expence])

    respond_to do |format|
      if @expence.save
---
INSERT INTO "expences" ("name", "created_at", "updated_at", "exp_type") VALUES(E'coffee', '2011-09-23 18:16:33.993960', '2011-09-23 18:16:33.993960', 'f') RETURNING "id"

  def update
    @expence = Expence.find(params[:id])

    respond_to do |format|
      if @expence.update_attributes(params[:expence])
---
SELECT * FROM `expences` WHERE (`expences`.`id` = 1)
UPDATE "expences" SET "updated_at" = '2011-09-23 18:11:53.692657', "exp_type" = 't' WHERE "id" = 1

  def destroy
    @expence = Expence.find(params[:id])
    @expence.destroy
---
SELECT * FROM "expences" WHERE ("expences"."id" = 2)
DELETE FROM "expences" WHERE "id" = 2