app/controllers/expence_perticulers_controller.rb

SELECT * FROM `expence_perticulers` ORDER BY date
SELECT * FROM `expences`
---
  def index
    @expence_perticulers = ExpencePerticuler.all
    @expence = Expence.all

SELECT * FROM "expences" WHERE ("expences"."exp_type" = 't')
---
  def new
    @expence_perticuler = ExpencePerticuler.new
    @expence_primary = Expence.find_all_by_exp_type(true)

SELECT * FROM "expence_perticulers" WHERE (cluser_name=NULL and shop_name=NULL and date=NULL)
---
  def edit
    #raise
    @expence_perticuler = ExpencePerticuler.find(:all,:conditions => ["cluser_name=? and shop_name=? and date=?",params[:clust_name],params[:shop_name],params[:date]])

INSERT INTO "expence_perticulers" ("cluser_name", "total", "date", "expence_id", "exp_value", "description", "shop_name", "adjusted_total") VALUES(E'dfjh', 58, '2009-05-01', 13, 232.0, NULL, E'dfjh', 60) RETURNING "id"
---
  def create
    #raise params.inspect
    @expence_perticuler = ExpencePerticuler.new(params[:expence_perticuler])

    respond_to do |format|
      #raise params[:expence_perticuler][:date].inspect
      c = params[:expence_perticuler][:cluser_name]
      s = params[:expence_perticuler][:shop_name]
      d = params[:expence_perticuler][:date]
      #raise params[:expence_perticuler_total].inspect
      t = params[:expence_perticuler_total]
      adt = params[:expence_perticuler_total1]
      if @expence_perticuler
        #raise @expence_perticuler.inspect
        if params[:expence_perticuler][:expence_attributes]
        params[:expence_perticuler][:expence_attributes].each do |rc|
          rct = ExpencePerticuler.new
          rct.expence_id = rc[1]["expence_id"]
          rct.exp_value = rc[1]["expence_value"]
          rct.description = rc[1]["description"]
          rct.cluser_name = c
          rct.shop_name = s
          rct.date = d
          rct.total = t
          rct.adjusted_total = adt
          rct.save!

SELECT * FROM "expence_perticulers" WHERE ("expence_perticulers"."id" = 4)
DELETE FROM "expence_perticulers" WHERE "id" = 4
---
  def destroy
    @expence_perticuler = ExpencePerticuler.find(params[:id])
    @expence_perticuler.destroy